// 開発者のつぶやきデータ（新しいものを上に追加してください）
const tweetsData = [
    {
        date: "2026.10.21",
        content: "各種アイコンが検索ヒット時には、適用されず試行錯誤中ー、頑張ろー",
        link: "",
        linkText: ""
    },
    {
        date: "2026.10.20",
        content: "各種サイトのアイコン追加、検索時の詳細テキストの追加、Web上のタイトル設定の確認・修正を行いましたー！軽く手間がかかったけどサイトが進化したのは👍️",
        link: "",
        linkText: ""
    },
    {
        date: "2026.10.18",
        content: "席替えメーカーをPCやタブレットの画面にも軽く対応しました！",
        link: "https://kyoro224.github.io/Sekigae_Maker/",
        linkText: "席替えメーカー"
    },
    {
        date: "2026.10.18",
        content: "席替えメーカーが完成しました！シンプルで割と使いやすいかも！自信作！！",
        link: "https://kyoro224.github.io/Sekigae_Maker/",
        linkText: "席替えメーカー"
    },
    {
        date: "2026.10.18",
        content: "今日の時点で作成した3つのサイトと開発者ページを繋げました！やったね~！",
        link: "",
        linkText: ""
    },
    {
        date: "2026.10.18",
        content: "つぶやきのデータを別ファイルに分けました！これでつぶやきがしやすくなるぜー",
        link: "",
        linkText: ""
    },
    {
        date: "2026.10.18",
        content: "開発者ページ＆開発者のつぶやきページ(このページ)を作りました！これからこのページでは、お知らせやつぶやきなどをしていきます！",
        link: "",
        linkText: ""
    }
];
